eclipse-threadx/getting-started/STMicroelectronics/STM32L4_L4+/app/console.c
/* Copyright (c) Microsoft Corporation.
   Licensed under the MIT License. */

#include "stm32l4xx_hal.h"

#include "board_init.h"

int __io_putchar(int ch)
{
	HAL_UART_Transmit(&UartHandle, (uint8_t *)&ch, 1, HAL_MAX_DELAY);
	return ch;
}

int __io_getchar(void)
{
	uint8_t ch;
	HAL_UART_Receive(&UartHandle, &ch, 1, 1);

	/* And cope with Windows */
	if (ch == '\r') {
		uint8_t ret = '\n';
		HAL_UART_Transmit(&UartHandle, &ret, 1, HAL_MAX_DELAY);
	}

	return ch;
}

#ifdef __ICCARM__
size_t __read(int file, unsigned char *ptr, size_t len)
#elif __GNUC__
int _read(int file, char *ptr, int len)
#else
#error unknown compiler
#endif
{
	int DataIdx;

	for (DataIdx = 0; DataIdx < len; DataIdx++)
	{
		*ptr++ = __io_getchar();
	}

	return len;
}

#ifdef __ICCARM__
size_t __write(int file, const unsigned char *ptr, size_t len)
#elif __GNUC__
int _write(int file, char *ptr, int len)
#else
#error unknown compiler
#endif
{
	int DataIdx;

	for (DataIdx = 0; DataIdx < len; DataIdx++)
	{
		__io_putchar(*ptr++);
	}
	return len;
}
